In [2]:
import pandas as pd
import numpy as np

In [71]:
file=open('D:/学习/唐宇迪-机器学习课程/唐宇迪-机器学习课程/机器学习算法配套案例实战/泰坦尼克船员获救/titanic_train.csv')
data=pd.read_csv(file)

In [72]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## describe基本统计特征

In [8]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

+ loc定位label
+ iloc定位position

In [12]:
data.iloc[0:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
df=data.set_index('Name')
df.loc['Braund, Mr. Owen Harris','Fare']

7.25

In [20]:
df[df['Fare']>40][:5]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S
"Fortune, Mr. Charles Alexander",28,0,1,male,19.0,3,2,19950,263.0000,C23 C25 C27,S
"Spencer, Mrs. William Augustus (Marie Eugenie)",32,1,1,female,NaN,1,0,PC 17569,146.5208,B78,C

In [24]:
df.loc[df['Sex']=='male','Age'].mean()

30.72664459161148

In [25]:
(df['Age']>70).sum()

5

In [35]:
len(df[df['Age']>70])

5

In [32]:
df.loc[df['Age']>70]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Goldschmidt, Mr. George B",97,0,1,male,71.0,0,0,PC 17754,34.6542,A5,C
"Connors, Mr. Patrick",117,0,3,male,70.5,0,0,370369,7.7500,NaN,Q
"Artagaveytia, Mr. Ramon",494,0,1,male,71.0,0,0,PC 17609,49.5042,NaN,C
"Barkworth, Mr. Algernon Henry Wilson",631,1,1,male,80.0,0,0,27042,30.0000,A23,S
"Svensson, Mr. Johan",852,0,3,male,74.0,0,0,347060,7.7750,NaN,S

## groupby

In [3]:
df=pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],'data':[0,5,10,0,5,10,0,5,10]})
df

   data key
0     0   A
1     5   B
2    10   C
3     0   A
4     5   B
5    10   C
6     0   A
7     5   B
8    10   C

In [6]:
df.groupby('key').sum()

     data
key
A       0
B      15
C      30

In [8]:
df.groupby('key').aggregate(np.mean) #求均值

     data
key
A       0
B       5
C      10

In [10]:
data.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [11]:
data.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [13]:
df=pd.DataFrame([[1,2,3],[4,5,6]],index=['a','b'],columns=['A','B','C'])
df

   A  B  C
a  1  2  3
b  4  5  6

In [14]:
df.sum()

A    5
B    7
C    9
dtype: int64

In [15]:
df.sum(axis=1)

a     6
b    15
dtype: int64

## 二元统计

In [4]:
data.corr()#相关系数

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [5]:
data.cov()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,66231.000000,-0.626966,-7.561798,138.696504,-16.325843,-0.342697,161.883369
Survived,-0.626966,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787
Pclass,-7.561798,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196
Age,138.696504,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030
SibSp,-16.325843,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734
Parch,-0.342697,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052
Fare,161.883369,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846

In [10]:
data['Survived'].value_counts(asciiending=True)

1    342
0    549
Name: Survived, dtype: int64

In [12]:
data['Age'].value_counts(bins=5) #分组计数

(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: Age, dtype: int64

In [82]:
bins=[10,40,80]
group_names=['youth','old']
bins_res=pd.cut(data['Age'],bins,labels=group_names)  #自定义bins,名称
bins_res.value_counts()

youth    500
old      150
Name: Age, dtype: int64

## merge合并

In [15]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [18]:
res=pd.merge(left,right,on='key')
res

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [26]:
left=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                   'key2':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                    'key2':['K0','K1','K2','K4'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})
res=pd.merge(left,right,on=['key1','key2'],how='outer',indicator=True) #outer全部拼接，没有补全  left左拼 right右拼
res

     A    B key1 key2    C    D      _merge
0   A0   B0   K0   K0   C0   D0        both
1   A1   B1   K1   K1   C1   D1        both
2   A2   B2   K2   K2   C2   D2        both
3   A3   B3   K3   K3  NaN  NaN   left_only
4  NaN  NaN   K3   K4   C3   D3  right_only

In [25]:
res=pd.merge(left,right,on=['key1','key2'],how='left',indicator=True) #outer全部拼接，没有补全
res

    A   B key1 key2    C    D     _merge
0  A0  B0   K0   K0   C0   D0       both
1  A1  B1   K1   K1   C1   D1       both
2  A2  B2   K2   K2   C2   D2       both
3  A3  B3   K3   K3  NaN  NaN  left_only

In [29]:
pd.get_option('display.max_rows')

60

## 数据透视表

In [30]:
example=pd.DataFrame({'Month':['January','January','January','January','February','February','February','February','March','March','March','March'],
                     'Category':['Transportation','Grocery','Household','Entertaiment',
                                'Transportation','Grocery','Household','Entertaiment',
                                'Transportation','Grocery','Household','Entertaiment',],
                     'Amount':[74,235,175,100,115,240,225,125,90,260,200,120]})
example

    Amount        Category     Month
0       74  Transportation   January
1      235         Grocery   January
2      175       Household   January
3      100    Entertaiment   January
4      115  Transportation  February
5      240         Grocery  February
6      225       Household  February
7      125    Entertaiment  February
8       90  Transportation     March
9      260         Grocery     March
10     200       Household     March
11     120    Entertaiment     March

In [49]:
example_pivot=example.pivot(index='Category',columns='Month',values='Amount')
example_pivot

Month           February  January  March
Category
Entertaiment         125      100    120
Grocery              240      235    260
Household            225      175    200
Transportation       115       74     90

In [44]:
example_pivot.sum(axis=1)

Category
Entertaiment      345
Grocery           735
Household         600
Transportation    279
dtype: int64

In [48]:
data.pivot_table(index='Sex',columns='Pclass',values='Fare') #m默认求均值

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [50]:
data.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='max') #指定最大值

Pclass         1     2      3
Sex
female  512.3292  65.0  69.55
male    512.3292  73.5  69.55

In [51]:
data.pivot_table(index='Sex',columns='Pclass',values='Fare',aggfunc='count') #指定个数

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

## 时间操作

In [52]:
import datetime

In [55]:
dt=datetime.datetime(year=2019,month=5,day=23,hour=10,minute=30)
print(dt)

2019-05-23 10:30:00

In [56]:
ts=pd.Timestamp('2019-5-23')
ts

Timestamp('2019-05-23 00:00:00')

In [57]:
ts.year

2019

In [58]:
ts.day

23

In [60]:
ts+pd.Timedelta('5 days')

Timestamp('2019-05-28 00:00:00')

In [61]:
pd.to_datetime('2019-5-23') #转换成pandas支持的格式

Timestamp('2019-05-23 00:00:00')

In [64]:
pd.Series(pd.date_range(start='2019-5-23',periods=10,freq='12H')) #构建时间序列

0   2019-05-23 00:00:00
1   2019-05-23 12:00:00
2   2019-05-24 00:00:00
3   2019-05-24 12:00:00
4   2019-05-25 00:00:00
5   2019-05-25 12:00:00
6   2019-05-26 00:00:00
7   2019-05-26 12:00:00
8   2019-05-27 00:00:00
9   2019-05-27 12:00:00
dtype: datetime64[ns]

In [ ]:
data['Time']=pd.to_datatime(data['Time'])
data=data.set_index('Time')
data[pd.Timestamp('2018-3-22 9:00'):pd.Timestamp('2018-3-22 12:00')]#时间切片 取时间
data[data.index.month==1]
data.between_time('8:00','12:00')

In [ ]:
data.resample('D').mean().head()  #数据重采样 按天取均值

## 其他操作

In [65]:
data=pd.DataFrame({'group':['a','a','a','b','b','b','c','c','c'],
                  'data':[4,3,2,1,12,3,4,5,7]})
data

   data group
0     4     a
1     3     a
2     2     a
3     1     b
4    12     b
5     3     b
6     4     c
7     5     c
8     7     c

In [67]:
data.sort_values(by=['group','data'],ascending=[False,True],inplace=True)  #先排第一个，再排第二个，inplace在原数据上修改
data

   data group
6     4     c
7     5     c
8     7     c
3     1     b
5     3     b
4    12     b
2     2     a
1     3     a
0     4     a

In [68]:
data.drop_duplicates()  #去重

   data group
6     4     c
7     5     c
8     7     c
3     1     b
5     3     b
4    12     b
2     2     a
1     3     a
0     4     a

In [70]:
data.drop_duplicates(subset='group')  #按字段去重

   data group
6     4     c
3     1     b
2     2     a

In [73]:
## apply函数对整个数据集使用，传入整个数据集

In [83]:
df=pd.DataFrame([range(3),[0,np.nan,0],[0,0,np.nan],range(3)])
df

   0    1    2
0  0  1.0  2.0
1  0  NaN  0.0
2  0  0.0  NaN
3  0  1.0  2.0

In [85]:
df.isnull()#判断缺失值

       0      1      2
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [87]:
df.isnull().any(axis=0)

0    False
1     True
2     True
dtype: bool

In [88]:
df.fillna(5)

   0    1    2
0  0  1.0  2.0
1  0  5.0  0.0
2  0  0.0  5.0
3  0  1.0  2.0

In [89]:
df[df.isnull().any(axis=1)]

   0    1    2
1  0  NaN  0.0
2  0  0.0  NaN

In [90]:
s=pd.Series(['a','a|b','a|c'])
s

0      a
1    a|b
2    a|c
dtype: object

In [91]:
s.str.get_dummies(sep='|') #独热码转换

   a  b  c
0  1  0  0
1  1  1  0
2  1  0  1